cheatsheets/emacs_edebug_maps_cheatsheet.org
:PROPERTIES:
:ID:       20ab2c77-ba4e-4213-99cc-a3767861178f
:END:
#+TITLE: Emacs: Global Edebug
#+DESCRIPTION: Emacs Cheatsheet
#+TAGS:

* Global

- C-x X :: prefix

|-----+-----------------------------------|
| a   | abort-recursive-edit              |
| Q   | edebug-top-level-nonstop          |
| q   | top-level                         |
| W   | edebug-toggle-save-windows        |
| w   | edebug-where                      |
| D   | edebug-toggle-disable-breakpoint  |
| X   | edebug-set-global-break-condition |
| x   | edebug-set-conditional-breakpoint |
| U   | edebug-unset-breakpoints          |
| u   | edebug-unset-breakpoint           |
| b   | edebug-set-breakpoint             |
| C   | edebug-Continue-fast-mode         |
| c   | edebug-continue-mode              |
| T   | edebug-Trace-fast-mode            |
| t   | edebug-trace-mode                 |
| G   | edebug-Go-nonstop-mode            |
| g   | edebug-go-mode                    |
|-----+-----------------------------------|
| SPC | edebug-step-mode                  |
| =   | edebug-display-freq-count         |
|-----+-----------------------------------|

* Eval

Uniq to =edebug-eval-mode=

|-----------+-------------------------------|
| <f12> C-b | elisp-byte-compile-buffer     |
| <f12> C-e | elisp-eval-region-or-buffer   |
| C-c C-d   | edebug-delete-eval-item       |
| C-c C-u   | edebug-update-eval-lits       |
| C-j       | edebug-eval-print-last-sexp   |
| DEL       | backward-delete-char-untabify |
|-----------+-------------------------------|

* Backtrace

|-----------------------+---|
| backtrace-goto-source | s |
|-----------------------+---|

* Edebug Mode Map

|-------+-----+-----------------------------------|
| local | key | function                          |
|-------+-----+-----------------------------------|
|       | DEL | backward-delete-char-untabify     |
|       | SPC | edebug-step-mode                  |
| **    | =   | edebug-temp-display-freq-count    |
|       | ?   | edebug-help                       |
|-------+-----+-----------------------------------|
|       | C   | edebug-Continue-fast-mode         |
|       | G   | edebug-Go-nonstop-mode            |
| *     | I   | edebug-instrument-callee          |
| *     | B   | edebug-next-breakpoint            |
|       | X   | edebug-set-global-break-condition |
| *     | S   | edebug-stop                       |
|       | D   | edebug-toggle-disable-breakpoint  |
|       | W   | edebug-toggle-save-windows        |
|       | Q   | edebug-top-level-nonstop          |
|       | T   | edebug-Trace-fast-mode            |
|       | U   | edebug-unset-breakpoints          |
| *     | P   | edebug-view-outside               |
| *     | E   | edebug-visit-eval-list            |
|-------+-----+-----------------------------------|
|       | a   | abort-recursive-edit              |
| *     | p   | edebug-bounce-point               |
|       | c   | edebug-continue-mode              |
| *     | e   | edebug-eval-expression            |
| *     | f   | edebug-forward-sexp               |
|       | g   | edebug-go-mode                    |
| *     | h   | edebug-goto-here                  |
| *     | n   | edebug-next-mode                  |
| *     | d   | edebug-pop-to-backtrace           |
| *     | r   | edebug-previous-result            |
|       | b   | edebug-set-breakpoint             |
|       | x   | edebug-set-conditional-breakpoint |
| *     | i   | edebug-step-in                    |
| *     | o   | edebug-step-out                   |
|       | t   | edebug-trace-mode                 |
|       | u   | edebug-unset-breakpoint           |
| *     | v   | edebug-view-outside               |
|       | w   | edebug-where                      |
|       | q   | top-level                         |
|-------+-----+-----------------------------------|


|-------------+-----------------------------------|
| C-c C-c     | edebug-go-mode                    |
| C-c C-d     | edebug-unset-breakpoint           |
| C-c C-l     | edebug-where                      |
| C-c C-n     | edebug-next-mode                  |
| C-c C-s     | edebug-step-mode                  |
| C-c C-t     | [byte-code]                       |
| C-x C-e     | edebug-eval-last-sexp             |
| C-x SPC     | edebug-set-breakpoint             |
|-------------+-----------------------------------|


|-------------+-----------------------------------|
| <f12> C-b   | elisp-byte-compile-buffer         |
| <f12> C-e   | elisp-eval-region-or-buffer       |
| <f12> C-f   | elisp-byte-compile-file           |
|-------------+-----------------------------------|

|-------------+-----------------------------------|
| C-M-i       | completion-at-point               |
| C-M-q       | indent-pp-sexp                    |
| C-M-x       | eval-defun                        |
| C-M-q       | indent-sexp                       |
| C-M-q       | prog-indent-sexp                  |
|-------------+-----------------------------------|

|-------------+-----------------------------------|
| C-x C-a C-c | edebug-go-mode                    |
| C-x C-a C-l | edebug-where                      |
| C-x C-a RET | edebug-set-initial-mode           |
| C-x C-a C-n | edebug-next-mode                  |
| C-x C-a C-s | edebug-step-mode* Backtrace       |
|-------------+-----------------------------------|

* Only in menus

+ edebug-toggle-save-windows
+ edebug-save-displayed-buffer-points
+ edebug-all-defs
+ edebug-all-forms

#+begin_src emacs-lisp
;; edebug-mode-menus

("Edebug"
 ["Stop" edebug-stop t]
 ["Step" edebug-step-mode t]
 ["Next" edebug-next-mode t]
 ["Trace" edebug-trace-mode t]
 ["Trace Fast" edebug-Trace-fast-mode t]
 ["Continue" edebug-continue-mode t]
 ["Continue Fast" edebug-Continue-fast-mode t]
 ["Go" edebug-go-mode t]
 ["Go Nonstop" edebug-Go-nonstop-mode t]
 "----"
 ["Help" edebug-help t]
 ["Abort" abort-recursive-edit t]
 ["Quit to Top Level" top-level t]
 ["Quit Nonstop" edebug-top-level-nonstop t]
 "----"
 ("Jumps"
  ["Forward Sexp" edebug-forward-sexp t]
  ["Step In" edebug-step-in t]
  ["Step Out" edebug-step-out t]
  ["Goto Here" edebug-goto-here t])
 ("Breaks"
  ["Set Breakpoint" edebug-set-breakpoint t]
  ["Unset Breakpoint" edebug-unset-breakpoint t]
  ["Unset Breakpoints In Form" edebug-unset-breakpoints t]
  ["Toggle Disable Breakpoint" edebug-toggle-disable-breakpoint t]
  ["Set Conditional Breakpoint" edebug-set-conditional-breakpoint t]
  ["Set Global Break Condition" edebug-set-global-break-condition t]
  ["Show Next Breakpoint" edebug-next-breakpoint t])
 ("Views"
  ["Where am I?" edebug-where t]
  ["Bounce to Current Point" edebug-bounce-point t]
  ["View Outside Windows" edebug-view-outside t]
  ["Previous Result" edebug-previous-result t]
  ["Show Backtrace" edebug-pop-to-backtrace t]
  ["Display Freq Count" edebug-display-freq-count t])
 ("Eval"
  ["Expression" edebug-eval-expression t]
  ["Last Sexp" edebug-eval-last-sexp t]
  ["Visit Eval List" edebug-visit-eval-list t])
 ("Options"
  ["Edebug All Defs" edebug-all-defs
   :style toggle :selected edebug-all-defs]
  ["Edebug All Forms" edebug-all-forms
   :style toggle :selected edebug-all-forms]
  "----"
  ["Tracing" (edebug-toggle 'edebug-trace)
   :style toggle :selected edebug-trace]
  ["Test Coverage" (edebug-toggle 'edebug-test-coverage)
   :style toggle :selected edebug-test-coverage]
  ["Save Windows" edebug-toggle-save-windows
   :style toggle :selected edebug-save-windows]
  ["Save Point" (edebug-toggle 'edebug-save-displayed-buffer-points)
   :style toggle :selected edebug-save-displayed-buffer-points]))
#+end_src
